-DATASET CSV tensor-list

--

-CASE TensorListTest

-LOG SimpleReturnTensorList
-STATEMENT MATCH (t:tensor) RETURN t.*
-PARALLELISM 8
-ENUMERATE
---- 6
0|[True,False]|[[0.1,0.2],[0.3,0.4]]|[[[1,2],[3,4]],[[5,6],[7,8]]]|1
3|[True,False]|[[0.1,0.2],[0.3,0.4]]|[[[3,4],[5,6]],[[7,8],[9,10]]]|2
4|[False,True]|[[0.4,0.8],[0.7,0.6]]|[[[5,6],[7,8]],[[9,10],[11,12]]]|
5|[True,True]|[[0.4,0.9],[0.5,0.2]]|[[[7,8],[9,10]],[[11,12],[13,14]]]|
6|[False,True]|[[0.2,0.4],[0.5,0.1]]|[[[9,10],[11,12]],[[13,14],[15,16]]]|5
8|[False,True]|[[0.6,0.4],[0.6,0.1]]|[[[11,12],[13,14]],[[15,16],[17,18]]]|6
