-DATASET PARQUET empty

--

-CASE CopyParquet

-STATEMENT CREATE NODE TABLE test1(a DOUBLE, b DOUBLE[2], PRIMARY KEY (a));
---- ok
-STATEMENT COPY test1 FROM "${KUZU_ROOT_DIRECTORY}/dataset/parquet/issue3481.parquet";
---- ok
-STATEMENT MATCH (a:test1) RETURN a.*;
---- 2
1.1100000143051147|[2.3,3.3]
4.409999847412109|[12.3,53.3]
-STATEMENT CREATE NODE TABLE test2(a FLOAT, b DOUBLE[], PRIMARY KEY (a));
---- ok
-STATEMENT COPY test2 FROM "${KUZU_ROOT_DIRECTORY}/dataset/parquet/issue3481.parquet";
---- ok
-STATEMENT MATCH (a:test2) RETURN a.*;
---- 2
1.11|[2.3,3.3]
4.41|[12.3,53.3]
