-DATASET PARQUET large-array
--

-CASE CopyLargeArray
-STATEMENT MATCH (u:person) RETURN u.ID, u.embedding ORDER BY u.ID DESC LIMIT 1;
---- 1
9998|[0.12365542417431907,0.7812631315551104,0.0011085356099281851,0.24928356764311976,0.4696162482249674,0.9458602905488147,0.36432885885512445,0.7888547129322487,0.009410003907154962,0.14925590883687234,0.5923277511637407,0.1682829253135919,0.06314473523901931,0.3046032374637623,0.1950978655578377,0.9670292906774133,0.7162288522226281,0.631408499691608,0.576477975673994,0.48385831170427607,0.6143110065002008,0.44088716055086663,0.39434814396727647,0.13574305251716579,0.5976609579479987,0.3580707399222296,0.02451882720815346,0.37415231483313627,0.5575060839902931,0.8760058596557566,0.612007112307388,0.13059874792785064,0.6790797282739914,0.6786513522962604,0.6734584219471965,0.13353188391847115,0.505030906411327,0.2209654770588768,0.026113391822429777,0.5717953532333429,0.42623459390857055,0.5502849845748403,0.0470885200998139,0.47422847029841764,0.8412754541319031,0.30204144201123595,0.48225369091559156,0.6067558139050889,0.8121608832132524,0.9990146186503468,0.9077311779123433,0.32198987972486337,0.1488140633729883,0.7133190888857227,0.24476020395744735,0.18540873743456376,0.8262477267069926,0.9315034814470768,0.48625261569239053,0.2654854469307327,0.4300172442160155,0.27483828050700654,0.40323393127112794,0.8547252258826695,0.8687176304781651,0.319589430548213,0.7392806465537415,0.20764096582740288,0.07256703554497623,0.10301419651824417,0.3142230768413069,0.8198606940858624,0.09935713903050869,0.9094479981667758,0.22872085873617476,0.8630317358313535,0.6251202554686889,0.8717003332070447,0.14927610769425914,0.252709879781563,0.18646063462613727,0.2523346260292504,0.3491496477335705,0.6615779797240047,0.05463567931005242,0.575431243282524,0.7933998136007417,0.4375498034560428,0.9918694090154848,0.8997396789605183,0.9331809925651698,0.0028554178330725266,0.587611009536503,0.7574709567839271,0.45564398597082845,0.9983257199402696,0.5116990783155967,0.033961778679296284,0.25555184946604703,0.4425195427541502,0.7039071348904327,0.801575744089526,0.45450208940056536,0.45251169677827396,0.6156729475398245,0.01451159766208554,0.3613254125599643,0.021649790195360175,0.021152248062824452,0.12167490765985978,0.7838327607681729,0.3816530788576089,0.29048287545570395,0.7243659954612274,0.7149492805298301,0.06211339141489658,0.8183246349519923,0.7803387863866935,0.541164913425471,0.04097688009617573,0.1892346683562537,0.43604873659007026,0.8155479932041412,0.40759564401698667,0.904772274684085,0.470955148935,0.08517620200280429,0.31980228432806446,0.6397825538927205,0.08843266480221512,0.34136842286845914,0.7245478899088341,0.4123447993106557,0.7628046039826257,0.8918287532411382,0.48940462944030294,0.563963756221896,0.8462034276487006,0.5488900145383974,0.8004147151714736,0.1439558369113929,0.1610623987777814,0.7090056306744243,0.3276505602883062,0.4794941897585059,0.41546423892632,0.4187407000348179,0.052669746191921774,0.9250063123027467,0.5162338449243644,0.9329920083391873,0.9703184842591899,0.6331180354720494,0.19548019456703147,0.7029943648058009,0.1343723418107322,0.07885122602416228,0.45607567717017805,0.8593935403042998,0.02103198478217483,0.8070084599593363,0.15579130359769855,0.557705244155168,0.06475788723636056,0.45590880273694245,0.08740275659916419,0.47580141817452415]
-STATEMENT MATCH (u:person) RETURN SUM(list_sum(u.embedding));
---- 1
783313.2913444978
