-DATASET CSV tinysnb

--

-CASE FunctionArithmetic

-LOG NestedNegateFunction
-STATEMENT RETURN - - 1, ---2.3, --5!
---- 1
1|-2.3|120

-LOG moduloFunctionOnUINT16UINT8Test
-STATEMENT MATCH (:person)-[a:studyAt]->(:organisation) RETURN a.ulength % a.ulevel
---- 3
0
90
18

-LOG sinFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) WHERE a.name <> 'abc' RETURN sin(a.mark)
---- 3
-0.5298361409084934
-0.8182771110644103
-0.8182771110644103

-LOG sinFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN sin(a.orgCode)
---- 3
-0.8116562156089902
-0.9880362734541701
0.7850177373512154

-LOG sinFunctionOnFloatTest
-STATEMENT MATCH (a:person) RETURN sin(a.height)
---- 8
0.8360259838332348
0.8414709848078965
0.9635581726618537
0.9694552549142643
0.9871948225688625
0.9941956062106823
0.9981524719181062
0.999573602345334

-LOG cosFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN cos(a.mark)
---- 3
-0.848100031710408
-0.5748239465332692
-0.5748239465332692

-LOG cosFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN cos(a.orgCode)
---- 3
-0.15422166624309427
-0.5841354189426392
0.6194732859809036

-LOG cosFunctionOnInt32Test
-STATEMENT MATCH (m:movies) RETURN cos(m.length)
---- 3
0.9439841391523142
0.7712145641969256
-0.8998799744648526

-LOG cosFunctionOnInt128Test
-STATEMENT MATCH (m:movies) RETURN cos(to_int128(m.length))
---- 3
0.9439841391523142
0.7712145641969256
-0.8998799744648526

-LOG tanFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN tan(a.mark)
---- 3
0.6247330752245639
1.4235264831943648
1.4235264831943648

-LOG tanFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN tan(a.orgCode)
---- 3
6.406598356269622
1.389500087288309
1.2672342054398371

-LOG cotFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN cot(a.mark)
---- 3
1.6006836193850378
0.7024807840287032
0.7024807840287032

-LOG cotFunctionOnInt16Test
-STATEMENT MATCH (:person)-[s:studyAt]->(:organisation) RETURN cot(s.length)
      ---- 3
-0.2958129155327456
-0.02213217480798041
112.9732103564319

-LOG cotFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN cot(a.orgCode)
---- 3
0.15608907323203436
0.7196832941202319
0.7891201134780889

-LOG asinFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN asin(a.rating)
---- 3
1.5707963267948966
0.8946658172342352
0.5468509506959441

-LOG asinFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN asin(a.orgCode % 2 - 1)
---- 3
0.0
-1.5707963267948966
-1.5707963267948966

-LOG acosFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN acos(a.rating)
---- 3
0.0
0.6761305095606613
1.0239453760989525

-LOG acosFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN acos(a.orgCode % 2 - 1)
---- 3
1.5707963267948966
3.141592653589793
3.141592653589793

-LOG modFunctionOnINT128Test
-STATEMENT RETURN to_int128(100) % to_int128(3)
---- 1
1

-LOG modNegFunctionOnINT128Test
-STATEMENT RETURN to_int128(-100) % to_int128(3)
---- 1
-1

-LOG negModFunctionOnINT128Test
-STATEMENT RETURN to_int128(100) % to_int128(-3)
---- 1
1

-LOG atanFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN atan(a.rating)
---- 3
0.7853981633974483
0.6624262938331512
0.4795192919925962

-LOG atanFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN atan(a.orgCode % 2 - 1)
---- 3
0.0
-0.7853981633974483
-0.7853981633974483

-LOG evenFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN even(a.mark)
---- 3
4.0
6.0
6.0

-LOG evenFunctionOnFloatTest
-STATEMENT MATCH (a:person) RETURN even(a.height)
---- 8
2.0
2.0
2.0
2.0
2.0
2.0
2.0
2.0

-LOG evenFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN even(a.orgCode)
---- 3
326.0
934.0
824.0

-LOG factorialFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN factorial(a.orgCode % 20)
---- 3
120
24
87178291200

-LOG factorialFunctionSyntaxInt64Test
-STATEMENT MATCH (a:organisation) RETURN (a.orgCode % 20)!
---- 3
120
24
87178291200

-LOG signFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN sign(a.mark)
---- 3
1
1
1

-LOG signFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN sign(a.orgCode)
---- 3
1
1
1

-LOG sqrtFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN sqrt(a.mark)
---- 3
1.9235384061671346
2.0248456731316584
2.0248456731316584

-LOG sqrtFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN sqrt(a.orgCode)
---- 3
18.027756377319946
30.56141357987225
28.705400188814647

-LOG cbrtFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN cbrt(a.mark)
---- 3
1.5466803737720354
1.6005206638831553
1.6005206638831553

-LOG cbrtFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN cbrt(a.orgCode)
---- 3
6.875344335370705
9.774974326369472
9.375096295307197

-LOG gammaFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN gamma(a.mark)
---- 3
4.170651783796604
6.812622863016676
6.812622863016676

-LOG gammaFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN gamma(a.orgCode % 10)
---- 3
24.0
6.0
6.0

-LOG lgammaFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN lgamma(a.mark)
---- 3
1.428072326665388
1.9187771947649626
1.9187771947649626

-LOG lgammaFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN lgamma(a.orgCode)
---- 3
1552.7704666093798
5451.570282841811
4706.038471046336

-LOG lnFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN ln(a.mark)
---- 3
1.308332819650179
1.410986973710262
1.410986973710262

-LOG lnFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN ln(a.orgCode)
---- 3
5.783825182329737
6.839476438228843
6.714170529909472

-LOG logFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN log(a.mark)
---- 3
0.568201724066995
0.6127838567197355
0.6127838567197355

-LOG logFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN log(a.orgCode)
---- 3
2.5118833609788744
2.9703468762300935
2.9159272116971158

-LOG log2FunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN log2(a.mark)
---- 3
1.8875252707415875
2.035623909730721
2.035623909730721

-LOG log2FunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN log2(a.orgCode)
---- 3
8.344295907915816
9.686500527183219
9.867278739709661

-LOG degreesFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN degrees(a.mark)
---- 3
211.9943841984046
234.91269600363748
234.91269600363748

-LOG degreesFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN degrees(a.orgCode)
---- 3
18621.128341751755
53514.25806521889
47211.72231877984

-LOG radiansFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) RETURN radians(a.mark)
---- 3
0.06457718232379019
0.0715584993317675
0.0715584993317675

-LOG radiansFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN radians(a.orgCode)
---- 3
5.672320068981571
16.301375213627036
14.381513036433274

-LOG atan2FunctionOnDoubleDoubleTest
-STATEMENT MATCH (a:organisation) RETURN atan2(a.mark, a.mark)
---- 3
0.7853981633974483
0.7853981633974483
0.7853981633974483

-LOG atan2FunctionOnDoubleInt64Test
-STATEMENT MATCH (a:organisation) RETURN atan2(a.mark, a.orgCode)
---- 3
0.004389693431593137
0.004975687093138375
0.011384123571548601

-LOG atan2FunctionOnInt64Int64Test
-STATEMENT MATCH (a:organisation) RETURN atan2(a.orgCode, a.orgCode)
---- 3
0.7853981633974483
0.7853981633974483
0.7853981633974483

-LOG atan2FunctionOnInt64DoubleTest
-STATEMENT MATCH (a:organisation) RETURN atan2(a.orgCode, a.mark)
---- 3
1.559412203223348
1.5658206397017582
1.5664066333633035

-LOG atan2FunctionOnFloatDoubleTest
-STATEMENT MATCH (a:person) RETURN atan2(a.height, a.eyeSight)
---- 8
0.1917331080155536
0.19739555984988075
0.26371182575491614
0.2644883732940026
0.3017699315088913
0.3156156664356463
0.3237492173854711
0.3332855063093084

-LOG roundFunctionOnDoubleTest
-STATEMENT MATCH (a:organisation) WHERE a.ID <> 2 RETURN round(a.rating, 1)
---- 3
0.8
0.5
1.0

-LOG roundFunctionOnInt64Test
-STATEMENT MATCH (a:organisation) RETURN round(a.orgCode, 2)
---- 3
325.0
824.0
934.0

-LOG piFunctionAddStrIntTest
-STATEMENT MATCH (a:organisation) RETURN a.orgCode + pi()
---- 3
328.1415926535898
937.1415926535898
827.1415926535898

-LOG AbsFunctionStrInt
-STATEMENT MATCH (a:organisation) RETURN abs(a.score)
---- 3
100
2
7

-LOG AbsFunctionInt128
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN abs(e.hugedata)
---- 3
1844674407370955161511
1844674407370955161811111111
15

-LOG FloorFunctionStrInt
-STATEMENT MATCH (a:organisation) RETURN floor(a.score)
---- 3
-2
-100
7

-LOG FloorFunctionInt128
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN floor(e.hugedata)
---- 3
-1844674407370955161511
1844674407370955161811111111
-15

-LOG CeilFunctionStrInt
-STATEMENT MATCH (a:organisation) RETURN ceil(a.score)
---- 3
-2
-100
7

-LOG CeilFunctionInt128
-STATEMENT MATCH (a:organisation) RETURN ceil(to_int128(a.score))
---- 3
-2
-100
7

-LOG BitwiseAndFunctionTest
-STATEMENT MATCH (p:person) RETURN p.age & 21
---- 8
1
20
5
20
20
17
0
17

-LOG BitwiseOrFunctionTest
-STATEMENT MATCH (o:organisation) RETURN o.score | 35
---- 3
-1
-65
39

-LOG BitshiftLeftFunctionTest
-STATEMENT MATCH (p:person) RETURN p.age << 2
---- 8
140
120
180
80
80
100
160
332

-LOG BitshiftRightFunctionTest
-STATEMENT MATCH (o:organisation) RETURN o.orgCode >> 3
---- 3
40
116
103

-LOG BitwiseOperatorPrecedenceTest
-STATEMENT MATCH (o:organisation) RETURN o.orgCode >> 2 | o.score & 2 << 1
---- 3
85
237
206

-LOG NumericalOperatorPrecedenceTest1
-STATEMENT MATCH (o:organisation) RETURN 3 & (o.score + 50)
---- 3
0
2
1

-LOG NumericalOperatorPrecedenceTest2
-STATEMENT MATCH (o:organisation) RETURN 2 + 3 << 5 + 2 & 1 + o.orgCode
---- 3
0
640
512

-LOG INT8OperatorTest
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN e.level + 1 + to_int8(3)
---- 3
9
124
6

-LOG Int128OperatorTest
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN e.hugedata + 1 - to_int128(3) * to_int128(2) - to_int128(9) / to_int128(3)
---- 3
1844674407370955161811111103
-1844674407370955161519
-23

-LOG INT128DivTest
-STATEMENT RETURN to_int128(6) / to_int128(3)
---- 1
2

-LOG INT128NegDivTest
-STATEMENT RETURN to_int128(-6) / to_int128(3)
---- 1
-2

-LOG INT128DivNegTest
-STATEMENT RETURN to_int128(6) / to_int128(-3)
---- 1
-2

-LOG INT128RangeTest
-STATEMENT RETURN to_int128(170141183460469231731687303715884105727)
---- 1
170141183460469231731687303715884105727

-LOG MultiplyTest
-STATEMENT RETURN cast(-2, "INT8") * cast(64, "INT8"), cast(-2, "INT16") * cast(16384, "INT16"), cast(-5, "INT32") * cast(5, "INT32"), cast(-5, "INT64") * cast(5, "INT64"), cast(-5, "INT128") * cast(5, "INT128"), cast(10, "UINT8") * cast(12, "UINT8"), cast(10, "UINT16") * cast(12, "UINT16"), cast(10, "UINT32") * cast(12, "UINT32"), cast(10, "UINT64") * cast(12, "UINT64"), cast(4324.123, "FLOAT") * cast(4324.123, "FLOAT"), cast(4324.123, "DOUBLE") * cast(4324.123, "DOUBLE");
---- 1
-128|-32768|-25|-25|-25|120|120|120|120|18698040.0|18698039.719128996
-STATEMENT MATCH (:person)-[a:studyAt]->(:organisation) WHERE a.ulength > 3 RETURN a.ulength, a.ulevel, cast(a.ulength, "INT64") * cast(a.ulevel, "INT64");
---- 3
180|12|2160
33768|250|8442000
90|220|19800
-STATEMENT RETURN cast(4294967295, "UINT64") * cast(4294967295, "UINT64");
---- 1
18446744065119617025

