-DATASET CSV tinysnb

--

-CASE FunctionTableID

-LOG NodeTableIDTest1
-STATEMENT MATCH (a:person) RETURN id(a), offset(id(a)), table_id(id(a))
---- 8
0:0|0|0
0:1|1|0
0:2|2|0
0:3|3|0
0:4|4|0
0:5|5|0
0:6|6|0
0:7|7|0

-LOG NodeTableIDTest2
-STATEMENT MATCH (a:organisation) RETURN id(a), offset(id(a)), table_id(id(a))
---- 3
1:0|0|1
1:1|1|1
1:2|2|1

-LOG NodeTableIDTest3
-STATEMENT MATCH (a:person) WHERE  offset(id(a))=0 and table_id(id(a))=0 RETURN a.fName
---- 1
Alice

-LOG RelTableIDTest2
-STATEMENT MATCH (:person)-[e:studyAt]->(:organisation) RETURN id(e), offset(id(e)), table_id(id(e))
---- 3
4:0|0|4
4:1|1|4
4:2|2|4
